app/Controllers/Attendance.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $attendanceModel = new AttendanceModel();
        $employeeModel = new EmployeeModel();
        $employees = $employeeModel->findAll();
---
SELECT *
FROM `employees`

    public function checkIn($employee_id)
    {
        $model = new AttendanceModel();

        $data = [
            'employee_id' => $employee_id,
            'check_in' => date('Y-m-d H:i:s'),
        ];

        $model->insert($data);
---
INSERT INTO `attendance` (`employee_id`, `check_in`) VALUES ('2', '2025-02-12 05:42:11')