app/Controllers/Attendance.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/iniciar-sesion');
        }

        $attendanceModel = new AttendanceModel();
        $employeeModel = new EmployeeModel();

        $data['attendanceStats'] = $attendanceModel->getAttendanceStatsLast7Days();

        // Asegurar que se listan todos los empleados, aunque no hayan hecho check-in
        $attendanceRecords = $employeeModel->select('employees.id, employees.name, attendance.check_in, attendance.check_out')
            ->join('attendance', 'attendance.employee_id = employees.id AND DATE(attendance.check_in) = CURDATE()', 'left')
            ->orderBy('employees.id', 'ASC')
            ->findAll();
---
SELECT `attendance`.*, `employees`.`name`
FROM `attendance`
JOIN `employees` ON `employees`.`id` = `attendance`.`employee_id`
SELECT `employees`.`id`, `employees`.`name`, `attendance`.`check_in`, `attendance`.`check_out`
FROM `employees`
LEFT JOIN `attendance` ON `attendance`.`employee_id` = `employees`.`id` AND DATE(attendance.check_in) = CURDATE()
ORDER BY `employees`.`id` ASC

    public function selfAttendance()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/iniciar-sesion');
        }

        $attendanceModel = new AttendanceModel();
        $employee_id = session()->get('user_id');

        // Obtener el registro de asistencia actual del día
        $attendance = $attendanceModel->where('employee_id', $employee_id)
            ->where('DATE(check_in)', date('Y-m-d'))
            ->first();
---
SELECT *
FROM `attendance`
WHERE `employee_id` IS NULL
AND `check_in` >= '2025-02-10'
ORDER BY `check_in` DESC