app/Controllers/Employee.php

SELECT *
FROM `employees`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `employees`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/iniciar-sesion');
        }

        $model = new EmployeeModel();
        $search = $this->request->getGet('search');
        $perPage = 10;
        $page = $this->request->getGet('page') ?? 1;

        if ($search) {
            $model->groupStart()
                  ->like('name', $search)
                  ->orLike('email', $search)
                  ->orLike('position', $search)
                  ->groupEnd();
        }

        $data['employees'] = $model->paginate($perPage);