app/Models/AttendanceModel.php

    public function getTotalHoursWorked($start_date, $end_date)
    {
        return $this->select("employees.name as employee_name,
                            ROUND(SUM(TIME_TO_SEC(TIMEDIFF(attendance.check_out, attendance.check_in)) / 3600), 2) as total_hours")
            ->join('employees', 'employees.id = attendance.employee_id')
            ->where('attendance.check_in >=', $start_date . ' 00:00:00')
            ->where('attendance.check_out <=', $end_date . ' 23:59:59')
            ->groupBy('attendance.employee_id')
            ->findAll();
---
SELECT `employees`.`name` as `employee_name`, ROUND(SUM(TIME_TO_SEC(TIMEDIFF(attendance.check_out, attendance.check_in)) / 3600), 2) as total_hours
FROM `attendance`
JOIN `employees` ON `employees`.`id` = `attendance`.`employee_id`
WHERE `attendance`.`check_in` >= '2025-02-17 00:00:00'
AND `attendance`.`check_out` <= '2025-02-19 23:59:59'
GROUP BY `attendance`.`employee_id`

    public function getGrandTotalHours($start_date, $end_date)
    {
        return $this->select("ROUND(SUM(TIME_TO_SEC(TIMEDIFF(check_out, check_in)) / 3600), 2) as grand_total")
            ->where('check_in >=', $start_date . ' 00:00:00')
            ->where('check_out <=', $end_date . ' 23:59:59')
            ->first();
---
SELECT ROUND(SUM(TIME_TO_SEC(TIMEDIFF(check_out, check_in)) / 3600), 2) as grand_total
FROM `attendance`
WHERE `check_in` >= '2025-02-17 00:00:00'
AND `check_out` <= '2025-02-19 23:59:59'
 LIMIT 1

    public function getAttendanceStatsLast7Days()
    {
        return $this->select("DATE(check_in) as date, COUNT(*) as total_attendances")
                    ->where('check_in >=', date('Y-m-d', strtotime('-7 days')))
                    ->groupBy('DATE(check_in)')
                    ->findAll();
---
SELECT DATE(check_in) as date, COUNT(*) as total_attendances
FROM `attendance`
WHERE `check_in` >= '2025-02-11'
GROUP BY DATE(check_in)